{
  "backend/main.mo": "Main Motoko actor implementing a social platform backend with username/password authentication, user profiles, contacts, messaging, and media sharing (photos/videos), using access control and blob storage mixins.",
  "feature_evidence.json": "JSON report mapping feature IDs to their implementation files, related components, test IDs, and confidence levels for features like ImageGenerator, VideoGenerator, and PhotoGallery fixes.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-sentence summaries of each frontend source file, describing their purpose and key implementation details.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining light and dark mode CSS custom properties for the design system's color tokens, radii, and sidebar variables.",
  "frontend/index.html": "Minimal HTML entry point titled 'ShareServe' that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Defines the TanStack Router tree with a protected layout route (redirects unauthenticated users to login) and registers all page routes including home, contacts, chat, profile, create, search, and settings.",
  "frontend/src/components/AnimatedHeading.tsx": "Reusable heading component that applies one of five neon/shimmer/gradient animation variants via Tailwind utility classes, supporting configurable HTML tag and className.",
  "frontend/src/components/ImageGenerator.tsx": "AI image generator component that maps prompt keywords to deterministic Picsum Photos URLs with a three-URL fallback chain, plus save, download, and regenerate actions.",
  "frontend/src/components/Layout.tsx": "Defines the main app layout with a sticky header, desktop navigation bar, user avatar/logout area, and a mobile bottom navigation bar. Wraps page content in a centered container and handles logout by clearing auth and query cache.",
  "frontend/src/components/MessageInput.tsx": "Chat input component supporting text messages, photo, and video file attachments with preview and upload progress. Sends on Enter key or button click and disables controls while sending or uploading.",
  "frontend/src/components/MessageList.tsx": "Renders a scrollable list of chat messages, distinguishing sent vs. received messages with different bubble styles and avatars. Shows loading and empty states, and auto-scrolls to the latest message.",
  "frontend/src/components/PhotoGallery.tsx": "Displays a grid of photos loaded from ExternalBlob objects, with fallback to picsum images on error and a lightbox modal for full-size viewing. Shows skeleton placeholders while loading and an empty state when no photos exist.",
  "frontend/src/components/PhotoUploader.tsx": "Provides a drag-and-drop style file picker for selecting and uploading a photo, showing a preview, upload progress bar, and success/error toasts. Uses the sharePhoto mutation hook to submit the image as an ExternalBlob.",
  "frontend/src/components/VideoFactsCarousel.tsx": "Auto-advancing carousel that cycles through a set of hardcoded trivia facts every 6 seconds with fade animation, category labels, dot indicators, and prev/next navigation buttons. Renders a styled background image with a color gradient overlay per fact.",
  "frontend/src/components/VideoGallery.tsx": "Renders a responsive grid of videos from ExternalBlob objects, with fallback MP4 URLs from Mixkit/Coverr CDNs if the primary source fails, and loading/error states per item.",
  "frontend/src/components/VideoGenerator.tsx": "Provides a video generation UI that maps text prompts to keyword-matched MP4 URLs from Mixkit/Coverr CDNs, with options to save, download, and share generated videos.",
  "frontend/src/components/VideoUploader.tsx": "Handles local video file selection, preview, and upload via the shareVideo mutation, showing upload progress and success/error toasts.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using TanStack Query, initializing it with the current Internet Identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Manages simple username-based authentication state persisted in localStorage, exposing login and logout callbacks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing identity state, login/clear functions, and login status flags.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all TanStack Query hooks for backend interactions including user auth, profile management, contacts, and video sharing mutations/queries.",
  "frontend/src/hooks/useSettings.ts": "Manages app settings (dark mode, notifications, autoplay) with localStorage persistence, exposing update and toggle helpers.",
  "frontend/src/index.css": "Global CSS file that imports Orbitron and Inter fonts, sets up Tailwind directives, and defines a dark-themed design system with OKLCH CSS variables for neon colors, glow effects, gradient text utilities, and custom component styles.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with TanStack Query's QueryClientProvider and a custom InternetIdentityProvider for authentication.",
  "frontend/src/pages/ChatPage.tsx": "Direct messaging page that displays a conversation between the current user and a partner, supporting sending messages via Enter key or button, with auto-scroll to the latest message.",
  "frontend/src/pages/ContactsPage.tsx": "Contacts management page with three tabs: viewing existing contacts, handling incoming contact requests (accept/decline), and searching for new users to add.",
  "frontend/src/pages/CreatePage.tsx": "Content creation page with two tabs: an AI generation tab for creating images and videos from text prompts, and an upload tab for sharing existing photos and videos.",
  "frontend/src/pages/HomePage.tsx": "Home dashboard page showing a personalized welcome banner, quick-action cards for navigating to create, contacts, and messages, and a summary of the user's profile.",
  "frontend/src/pages/LoginPage.tsx": "Renders a login form with username/password fields, validation, and password visibility toggle, then calls the login mutation and navigates to home on success.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the authenticated user's profile (avatar initials, display name, bio) with an edit dialog, and shows their photos and videos in tabs.",
  "frontend/src/pages/RegisterPage.tsx": "Renders a registration form with username, password, confirm password, display name, and bio fields, then registers and auto-logs in the user on success.",
  "frontend/src/pages/SearchPage.tsx": "Provides tabbed photo and video search UI using deterministically generated Picsum URLs, with a lightbox for photos and a loading simulation on search.",
  "frontend/src/pages/SettingsPage.tsx": "Renders toggle-based settings rows for dark mode, notifications, and autoplay videos, grouped by category, using the useSettings hook.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts, OKLCH-based color tokens, neon glow shadows, and animation keyframes for a dark cyberpunk-style UI.",
  "project_state.json": "Project state descriptor for ShareServe, an in-app messaging and media-sharing application, documenting existing features, known issues (broken auth, broken media display, AI generation bugs), and architectural constraints."
}