{
  "backend/main.mo": "Main Motoko actor implementing the backend for a social app with user registration, profiles, contacts, messaging, and photo/video sharing, using access control and blob storage mixins.",
  "feature_evidence.json": "JSON report mapping implemented features (messaging, photo sharing, video sharing, AI image generation) to their relevant frontend files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON object containing one-sentence summaries of key frontend files including ProfilePage, ImageGenerator, VideoGenerator, CreatePage, and App.tsx.",
  "frontend/index.css": "Global CSS file that sets up Tailwind directives and defines light/dark mode CSS custom properties for the design system's color tokens and sidebar variables.",
  "frontend/index.html": "Minimal HTML entry point for the ShareServe app that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all app routes and an AuthGate that gates access behind Internet Identity login and user registration.",
  "frontend/src/components/AnimatedHeading.tsx": "Reusable heading component that applies one of several neon/gradient animation variants using Tailwind utility classes and supports configurable HTML heading tags.",
  "frontend/src/components/ImageGenerator.tsx": "AI image generation UI component that simulates generation with a delay, displays a placeholder image based on the prompt, and allows saving to the user's profile or downloading the result.",
  "frontend/src/components/Layout.tsx": "Main app layout component with a sticky header, desktop/mobile navigation, user avatar display, and logout functionality using Internet Identity.",
  "frontend/src/components/MessageInput.tsx": "Chat input component supporting text messages, photo, and video file attachments with preview, upload progress, and send-on-Enter behavior.",
  "frontend/src/components/MessageList.tsx": "Renders a scrollable list of chat messages, distinguishing sent vs. received messages with avatars, timestamps, and loading/empty states.",
  "frontend/src/components/PhotoGallery.tsx": "Displays a grid of photos from ExternalBlob objects with a lightbox overlay for full-size viewing and loading skeleton states.",
  "frontend/src/components/PhotoUploader.tsx": "Photo upload component with file selection, preview, upload progress bar, and integration with the sharePhoto mutation hook.",
  "frontend/src/components/VideoFactsCarousel.tsx": "Auto-advancing carousel that displays a set of hardcoded interesting facts with category labels, navigation dots, and animated transitions.",
  "frontend/src/components/VideoGallery.tsx": "Renders a responsive grid of video players from ExternalBlob objects with loading skeleton states and an empty state placeholder.",
  "frontend/src/components/VideoGenerator.tsx": "A UI component that simulates AI video generation from a text prompt, displaying a placeholder thumbnail with progress animation, and allows saving or downloading the result.",
  "frontend/src/components/VideoUploader.tsx": "A file upload component that lets users select a local video file, preview it, and upload it via the shareVideo mutation with progress tracking.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (authenticated or anonymous) using TanStack Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all TanStack Query hooks for backend interactions, covering user profiles, search, contacts, messaging, and video sharing mutations.",
  "frontend/src/index.css": "Global stylesheet defining a dark neon-themed design system with Tailwind CSS, custom OKLCH color variables, and utility classes for neon glow effects, gradients, and styled inputs/buttons.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/ChatPage.tsx": "Renders a chat interface for a specific contact identified by username, displaying a header with contact info and a message list, but notes a limitation where conversation fetching requires a Principal ID not available from UserProfile.",
  "frontend/src/pages/ContactsPage.tsx": "Displays the user's contacts, pending requests, and a search interface (by username or profile number) with add/accept/decline actions, though some operations are limited by the absence of Principal IDs in UserProfile data.",
  "frontend/src/pages/CreatePage.tsx": "Provides a tabbed UI for creating content, offering AI-based image and video generation via ImageGenerator/VideoGenerator components and manual media uploads via PhotoUploader/VideoUploader components.",
  "frontend/src/pages/HomePage.tsx": "Renders the main dashboard with a personalized welcome banner, quick-action navigation links, contact stats, and a VideoFactsCarousel component.",
  "frontend/src/pages/LoginPage.tsx": "Displays the login screen with Internet Identity authentication, featuring the app logo, feature highlight pills, and a sign-in button that triggers the login flow.",
  "frontend/src/pages/ProfilePage.tsx": "Shows a user's profile (own or another's) with avatar, bio, photo/video galleries, and an edit modal that supports updating display name, bio, and uploading a new profile picture with progress tracking.",
  "frontend/src/pages/RegisterPage.tsx": "Registration page component that collects username, display name, and bio, validates input, calls the register mutation, and handles logout via Internet Identity.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters from query strings or hash-based routes, persisting them in sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts (Orbitron, Inter), neon color tokens, box shadows, border radii, and keyframe animations for the ShareServe dark/neon UI theme.",
  "project_state.json": "Project state manifest describing ShareServe's features, architecture, known issues, image requirements, and versioned feature list for build planning."
}