{
  "backend/main.mo": "Main Motoko actor implementing a social media backend with username/password authentication, user profiles, contacts, messaging, and media sharing (photos/videos), using access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (SearchPage rewrite with Unsplash/Pexels/fallback logic, ImageGenerator with Pollinations AI) to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, describing the purpose and key implementation details of pages, components, and hooks.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, sidebar, chart colors, etc.).",
  "frontend/index.html": "Minimal HTML shell for the ShareServe React app, mounting the app into a `#root` div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Defines the TanStack Router route tree with all app routes (home, login, register, profile, contacts, chat, create, search, settings) and renders the RouterProvider.",
  "frontend/src/components/AnimatedHeading.tsx": "Reusable heading component supporting multiple neon/glow/shimmer/gradient animation variants via Tailwind utility classes and an Orbitron font.",
  "frontend/src/components/ImageGenerator.tsx": "AI image generator component using the Pollinations AI endpoint with random seed generation, up to 3 automatic retries on error, a loading spinner, and Save/Download/Regenerate actions.",
  "frontend/src/components/Layout.tsx": "Main app layout component with a sticky header, desktop navigation bar, and mobile bottom navigation, conditionally rendering nav items based on authentication state.",
  "frontend/src/components/MessageInput.tsx": "Chat message input component supporting text, photo, and video sending with file preview, upload progress, and Enter-to-send keyboard handling.",
  "frontend/src/components/MessageList.tsx": "Renders a scrollable list of chat messages with sender-based alignment, avatars, timestamps, and loading/empty states.",
  "frontend/src/components/PhotoGallery.tsx": "Displays a grid of photos loaded from ExternalBlob objects with fallback URLs, a lightbox modal, and loading/error states.",
  "frontend/src/components/PhotoUploader.tsx": "Photo upload component that lets users select an image file, previews it, tracks upload progress, and shares it via the useSharePhoto mutation.",
  "frontend/src/components/VideoFactsCarousel.tsx": "Auto-advancing carousel that displays a rotating set of interesting facts with category labels, animated transitions, and manual prev/next navigation.",
  "frontend/src/components/VideoGallery.tsx": "Renders a responsive grid of video items from ExternalBlob sources, with fallback MP4 URLs from Mixkit/Coverr if the primary source fails, and loading/error states.",
  "frontend/src/components/VideoGenerator.tsx": "Provides a video generation UI that attempts to fetch videos via Pollinations AI and Pexels API, falling back to a curated pool of Mixkit MP4s based on the user's prompt.",
  "frontend/src/components/VideoUploader.tsx": "Handles local video file selection, preview, and upload to the backend via the shareVideo mutation, showing upload progress and success/error toasts.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP backend actor using the current Internet Identity, initializing access control and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAuth.ts": "Manages simple username-based authentication state persisted in localStorage, exposing login and logout callbacks.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing identity, login/clear functions, and login status.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for all backend interactions including user auth, profile management, contacts, and video sharing mutations/queries.",
  "frontend/src/hooks/useSettings.ts": "Manages app settings (dark mode, notifications, autoplay) with localStorage persistence, exposing update and toggle helpers.",
  "frontend/src/index.css": "Global stylesheet that imports Orbitron and Inter fonts, sets up Tailwind directives, defines dark-theme CSS custom properties (OKLCH colors), and provides utility classes for neon colors, glow effects, gradients, and themed UI components.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with TanStack QueryClientProvider and a custom InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/BrowserPage.tsx": "Empty file with no content or exports defined.",
  "frontend/src/pages/ChatPage.tsx": "Direct messaging page that displays a conversation between the current user and a partner (identified by URL param), supports sending messages via Enter key or button, and auto-scrolls to the latest message.",
  "frontend/src/pages/ContactsPage.tsx": "Contacts management page with three tabs: viewing existing contacts, handling incoming contact requests (accept/decline), and searching for new users to send contact requests to.",
  "frontend/src/pages/CreatePage.tsx": "Content creation page with two tabs — AI Generate (image and video generation via prompts) and Upload Media (photo and video uploaders) — using sub-components for each creation mode.",
  "frontend/src/pages/HomePage.tsx": "Home dashboard page showing a personalized welcome banner, quick-action cards for navigating to create/contacts/messages, and a profile summary section for the authenticated user.",
  "frontend/src/pages/LoginPage.tsx": "Renders a login form with username/password fields, validation, and password visibility toggle, then calls the login mutation and navigates to home on success.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the authenticated user's profile (avatar initials, display name, bio) with an edit dialog, and shows their photos and videos in tabs.",
  "frontend/src/pages/RegisterPage.tsx": "Renders a registration form with username, password, confirm password, display name, and bio fields, then registers and auto-logs in the user on success.",
  "frontend/src/pages/SearchPage.tsx": "Provides a search interface for photos and videos using the Pexels API for images and a pool of fallback Mixkit MP4s for videos, displayed in tabbed results.",
  "frontend/src/pages/SettingsPage.tsx": "Renders app preference toggles (dark mode, notifications, autoplay videos) grouped by category using the useSettings hook, plus a static About section.",
  "frontend/src/utils/urlParams.ts": "Utility module for extracting, persisting, and cleaning URL parameters from both query strings and hash-based routes. Supports sessionStorage-backed persistence and safe removal of sensitive params (e.g., admin tokens) from the address bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom fonts (Orbitron, Inter), OKLCH-based color tokens (including neon variants), neon box-shadow utilities, border radii, and keyframe animations for accordion, shimmer, glow, and neon-border effects.",
  "project_state.json": "Project state manifest for ShareServe (v21), documenting the app's architectural constraints, known issues (broken auth, media rendering, AI generators), and the full list of existing and planned features with requirement IDs."
}