{
  "backend/main.mo": "Main Motoko actor implementing a social platform backend with user registration/authentication, profiles, contacts, messaging, and shared media, using access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting the dark neon theme restoration feature, listing all affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files, describing the purpose and key implementation details of each page, component, and hook.",
  "frontend/index.css": "Root Tailwind CSS entry point defining light and dark mode CSS custom properties for the shadcn-ui design token system (backgrounds, foregrounds, borders, chart colors, sidebar).",
  "frontend/index.html": "Minimal HTML shell for the React app titled 'ShareServe', mounting the app at the `#root` div and loading `src/main.tsx` as a module.",
  "frontend/src/App.tsx": "Defines the TanStack Router route tree with a `RootLayout` wrapper that renders `Layout` around all routes, including public (login/register) and protected (home, profile, chat, etc.) routes.",
  "frontend/src/components/AnimatedHeading.tsx": "Reusable heading component supporting three neon animation variants—shimmer (gradient text), glow (cyan text shadow pulse), and typewriter—using CSS custom properties for neon colors.",
  "frontend/src/components/DailyChallengeWidget.tsx": "Widget that displays a deterministic daily AI image prompt (selected by day-of-year from a preset list) with a neon-styled 'Use This Prompt' button that calls an `onUsePrompt` callback.",
  "frontend/src/components/DesignCustomizer.tsx": "A React component that renders a design customization panel allowing users to select color palettes, print sizes, finishes, quantity, and custom text, emitting changes via a callback prop.",
  "frontend/src/components/ImageGenerator.tsx": "A React component that generates images from a text prompt by trying multiple external image sources (Pollinations, Picsum, Unsplash) in sequence, with options to download, save, or add the result to a cart.",
  "frontend/src/components/Layout.tsx": "A top-level layout component that renders a responsive sidebar/bottom-nav with navigation links, user auth controls, and notification badges, hiding navigation on public routes like login and register.",
  "frontend/src/components/MessageInput.tsx": "A chat message input component with an auto-resizing textarea that sends messages on Enter key or button click, with a loading spinner state and neon-styled send button.",
  "frontend/src/components/MessageList.tsx": "A component that renders a list of chat messages, visually distinguishing sent vs. received messages with different bubble styles and displaying timestamps.",
  "frontend/src/components/PhotoGallery.tsx": "A photo gallery component that loads and displays images from ExternalBlob objects with multi-level fallback URLs, a loading skeleton, and a lightbox modal for zoomed viewing.",
  "frontend/src/components/PhotoUploader.tsx": "A photo upload component that lets users select an image file, preview it, and share it via the `useSharePhoto` mutation with upload progress tracking and toast notifications.",
  "frontend/src/components/StoriesRow.tsx": "Renders a horizontal scrollable row of avatar buttons for all users except the current one, opening a `StoryViewerModal` when clicked.",
  "frontend/src/components/StoryViewerModal.tsx": "A fullscreen modal overlay that displays a user's profile info (avatar initials, display name, bio) with an auto-advancing progress bar animation that closes the modal on completion.",
  "frontend/src/components/SuggestedUsers.tsx": "Displays up to 5 suggested users (not already contacts) with an 'Add' button that sends a contact request via `useSendContactRequest`.",
  "frontend/src/components/TrendingTopics.tsx": "Renders a list of hardcoded trending hashtag buttons with neon colors that navigate to the search page with the selected topic on click.",
  "frontend/src/components/VideoFactsCarousel.tsx": "An auto-advancing carousel that cycles through a set of hardcoded interesting facts every 6 seconds, with manual prev/next navigation and dot indicators.",
  "frontend/src/components/VideoGallery.tsx": "Displays a grid of video players from `ExternalBlob` sources, with fallback to public MP4 URLs if the primary source fails to load.",
  "frontend/src/components/VideoGenerator.tsx": "React component that generates videos from text prompts by mapping keywords to curated Mixkit MP4 URLs, with download and share functionality.",
  "frontend/src/components/VideoUploader.tsx": "React component for selecting and uploading a video file, showing a preview and upload progress before sharing it via the backend mutation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useAuth.ts": "Simple auth hook that persists a username to localStorage and exposes login/logout helpers along with an isAuthenticated flag.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity context and provider using DFINITY's AuthClient, exposing login/clear functions and status flags for ICP-based authentication.",
  "frontend/src/hooks/useNotificationCounts.ts": "Hook that returns notification counts (pending contact requests and a placeholder unread message count) for the current user.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend interactions including auth, user profiles, contacts, messaging, and video sharing mutations/queries.",
  "frontend/src/hooks/useSettings.ts": "Hook that loads, persists, and exposes app settings (dark mode, notifications, autoplay) from localStorage with update and toggle helpers.",
  "frontend/src/index.css": "Global stylesheet that imports Inter and Orbitron fonts, sets up Tailwind, defines CSS custom properties for a dark neon-themed design system, and provides utility classes for neon text/border/glow effects and animations.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with TanStack Query's QueryClientProvider and a custom InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/BrowserPage.tsx": "Empty file with no content or exports.",
  "frontend/src/pages/ChatPage.tsx": "Chat page component that displays a contacts sidebar and a conversation area, allowing users to select contacts and exchange messages using custom query hooks.",
  "frontend/src/pages/ContactsPage.tsx": "Contacts management page with three tabs—My Contacts, Requests, and Find People—supporting contact search, sending/accepting/declining contact requests, and displaying suggested users.",
  "frontend/src/pages/CreatePage.tsx": "Content creation page with four tabs for AI image generation, AI video generation, photo upload, and video upload, plus a daily challenge widget that can pre-fill the image generator prompt.",
  "frontend/src/pages/CustomizeDesignPage.tsx": "Design customization page that lets users configure size, finish, color palette, quantity, and custom text for a generated AI image before proceeding to a purchase confirmation page.",
  "frontend/src/pages/HomePage.tsx": "Home page featuring a hero banner with the user's name, a stories row, quick-action grid cards for Create/Discover/Chat/Contacts, and trending topics with suggested users sections.",
  "frontend/src/pages/LoginPage.tsx": "Renders a login form that authenticates users via the backend actor's `loginUser` method and redirects to the home page on success. Includes neon-styled UI with username/password fields and error handling.",
  "frontend/src/pages/ProfilePage.tsx": "Displays the authenticated user's profile with avatar, display name, bio, and tabbed photo/video galleries. Supports inline editing of display name and bio via `useUpdateUserProfile`.",
  "frontend/src/pages/PurchaseConfirmationPage.tsx": "Shows an order summary for a customized AI-generated design (pulled from sessionStorage) and handles purchase completion by saving the image to the user's profile via `useSharePhoto`. Displays a success screen after purchase.",
  "frontend/src/pages/RegisterPage.tsx": "Renders a registration form that calls the backend actor's `registerUser` method and logs the user in on success. Validates required fields, password length, and matching passwords before submission.",
  "frontend/src/pages/SearchPage.tsx": "Provides a search interface with tabbed photo and video results sourced from static Picsum and Mixkit URLs, filtered by a text query. Includes a lightbox for photo previews.",
  "frontend/src/pages/SettingsPage.tsx": "React settings page that displays account info, toggleable preferences (dark mode, notifications, autoplay), an about section, and a logout button using useAuth and useSettings hooks.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to extract URL parameters from query strings or hash-based routes, persist them in sessionStorage, and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with OKLCH-based semantic colors, neon color variants, Orbitron/Inter fonts, neon box shadows, and custom keyframe animations like shimmer and glow-pulse.",
  "project_state.json": "Project state manifest (version 29) describing ShareServe's features, architectural constraints, and known issues such as broken auth, non-rendering media, and broken AI generators."
}