{
  "kind": "build_request",
  "title": "Fix media display layout, replace YouTube with alternative video sources, and use multiple image platforms",
  "projectName": "ShareServe",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-27",
      "text": "Fix the layout of the ImageGenerator component so that generated images are always visible. Replace any broken or question-mark-producing image sources. Use multiple public image platforms as sources (e.g., Unsplash, Picsum, Pexels) so that if one platform fails to load, the component falls back to another. The generated image must always render visibly in the UI — no broken image icons or question mark placeholders.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "video and images show a question can't see",
          "use multiple image platforms"
        ]
      },
      "acceptanceCriteria": [
        "Generated images display visibly in the ImageGenerator component after prompt submission",
        "No broken image icons or question mark placeholders appear for generated images",
        "Image sources are drawn from at least two different public platforms (e.g., Unsplash and Picsum/Pexels)",
        "If one image source URL fails to load, the component falls back to an alternative platform URL"
      ]
    },
    {
      "id": "REQ-28",
      "text": "Fix the layout of the VideoGenerator component so that generated videos always render visibly inline. Replace all YouTube-based video sources with direct MP4 URLs from at least two alternative platforms (e.g., Mixkit and Pexels Videos free-tier direct MP4 links, or Coverr and Pixabay). The generated video must display as a playable <video> element immediately after generation — no question mark placeholders or broken media icons.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "video and images show a question can't see",
          "don't use utube for videos use others two"
        ]
      },
      "acceptanceCriteria": [
        "Generated videos display as an inline playable <video> element in the VideoGenerator component after prompt submission",
        "No YouTube URLs are used anywhere in the VideoGenerator component",
        "Video sources come from at least two alternative platforms (e.g., Mixkit CDN and Pexels direct MP4 URLs)",
        "No broken video icons or question mark placeholders appear for generated videos",
        "Videos play without requiring authentication or special permissions"
      ]
    },
    {
      "id": "REQ-29",
      "text": "Fix the layout of the PhotoGallery component so that all photos (uploaded to profile feed or shared in chats) render visibly. Replace any single-source image URL construction with a multi-platform fallback approach — attempt to load from the stored source first, then fall back to a secondary public image platform (e.g., Picsum Photos) if the primary fails. Ensure the grid and lightbox views both display images correctly with no broken image icons or question marks.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "video and images show a question can't see",
          "use multiple image platforms"
        ]
      },
      "acceptanceCriteria": [
        "Photos in the PhotoGallery grid view render visibly without question mark placeholders",
        "Photos in the PhotoGallery lightbox view render visibly",
        "If the primary image source fails to load, a fallback image from a secondary platform is shown",
        "Photos shared in chat messages also render without broken icons"
      ]
    },
    {
      "id": "REQ-30",
      "text": "Fix the layout of the VideoGallery component so that all videos (uploaded to profile feed or shared in chats) render visibly as inline playable <video> elements. Remove any YouTube-based source URLs. Use direct MP4 URL sources from at least two alternative platforms (Mixkit, Pexels, Coverr, or Pixabay) as fallback sources. Ensure no broken video icons or question mark placeholders appear in the grid view or in chat messages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "video and images show a question can't see",
          "don't use utube for videos use others two"
        ]
      },
      "acceptanceCriteria": [
        "Videos in the VideoGallery grid view render as playable <video> elements without question mark placeholders",
        "Videos shared in chat messages render and play inline without broken icons",
        "No YouTube URLs are used in the VideoGallery component",
        "Video sources include at least two alternative CDN/platform options for fallback"
      ]
    },
    {
      "id": "REQ-31",
      "text": "Fix the layout of the SearchPage photo and video tabs so that search results display visibly. For photo search, use multiple image source platforms (e.g., Unsplash source URLs and Picsum as fallback) so results always load. For video search, replace any YouTube-based embed or search results with direct MP4 sources from two alternative platforms (e.g., Pexels Videos API free tier and Mixkit). Ensure all search result thumbnails and videos render without broken icons or question mark placeholders.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "video and images show a question can't see",
          "don't use utube for videos use others two",
          "use multiple image platforms"
        ]
      },
      "acceptanceCriteria": [
        "Photo search results display as visible images in the grid — no broken icons or question marks",
        "Photo search uses at least two image source platforms with fallback behavior",
        "Video search results display as playable inline <video> elements — not YouTube iframes",
        "No YouTube URLs or embeds are used in the video search results",
        "Video search sources come from at least two alternative platforms (e.g., Pexels API and Mixkit)"
      ]
    }
  ],
  "constraints": [
    "Do not use YouTube (youtube.com or youtu.be) URLs anywhere in VideoGenerator, VideoGallery, or SearchPage video tab",
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "All video content must use direct MP4 URLs playable via the HTML <video> element — no iframes for generated or gallery videos"
  ],
  "nonGoals": [
    "Adding new navigation routes or pages",
    "Changing authentication logic",
    "Modifying backend data models or storage",
    "Adding new AI generation features",
    "Changing the overall dark neon theme or layout structure beyond fixing broken media display"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}