{
  "kind": "build_request",
  "title": "Restore original dark neon theme layout across all screens",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-54",
      "text": "Restore the original dark neon theme layout across all pages and components. All screens (Login, Register, Home, Chat, Contacts, Profile, Create, Search, Settings, CustomizeDesign, PurchaseConfirmation) must use deep near-black backgrounds, vibrant neon accent colors (electric violet, cyan, hot pink), glowing UI elements, animated text effects (shimmer, glow, typewriter), gradient highlights, and a sleek futuristic layout. Ensure the CSS custom properties defined in frontend/src/index.css and frontend/index.css for the dark neon design system (cyan, pink, violet, green, yellow accents) are consistently applied. Re-apply the Tailwind dark theme tokens and neon color variables from frontend/tailwind.config.js across all components and pages that may have drifted from the intended dark style.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Go back to the old dark layout of the website"
        ]
      },
      "acceptanceCriteria": [
        "All pages render with deep near-black backgrounds (no light or white backgrounds visible).",
        "Neon accent colors (cyan, violet, hot pink) are consistently applied to buttons, borders, headings, and interactive elements across all screens.",
        "Glowing UI elements and gradient highlights are visible on cards, nav items, and action buttons.",
        "Navigation (desktop sidebar and mobile bottom nav) uses the dark neon theme with no light-mode styling.",
        "Login and Register pages display the neon dark theme with styled form fields and neon-colored call-to-action buttons.",
        "The Settings, Profile, Create, Search, Chat, Contacts, Home, CustomizeDesign, and PurchaseConfirmation pages all render consistently in the dark neon style.",
        "Animated text effects (shimmer, glow, or typewriter) are present where previously applied (e.g., AnimatedHeading component usage).",
        "No page or component defaults to a light or unstyled white background."
      ]
    }
  ],
  "constraints": [
    "Do not modify files listed under frontend.immutablePaths (useInternetIdentity.ts, useActor.ts, main.tsx, components/ui).",
    "Do not alter backend logic or data models.",
    "Do not remove or break any existing features while restoring the theme."
  ],
  "nonGoals": [
    "Adding new features or pages.",
    "Changing the color palette to anything other than the existing neon dark scheme (deep blacks, cyan, violet, hot pink).",
    "Modifying backend Motoko code.",
    "Changing authentication logic."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}