{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Search (real internet results) and AI generators",
  "requirements": [
    {
      "id": "REQ-41",
      "summary": "Rewrite SearchPage to deliver real internet search results for photos (Unsplash/Picsum) and videos (Pexels API with Mixkit/Coverr/Pixabay fallback pool)",
      "acceptanceCriteria": [
        "Typing a query in the photo tab and submitting returns a grid of 12 images that are visually relevant to the query.",
        "Each photo image attempts to load from Unsplash source URL first, then falls back to Picsum if the primary fails — no broken image icons.",
        "Typing a query in the video tab and submitting returns up to 9 inline playable <video> elements relevant to the query.",
        "If the Pexels API key is missing or the call fails, keyword-matched fallback MP4 videos are shown instead of an error.",
        "No search result is saved to the user's profile or visible to other users.",
        "No random or query-unrelated placeholder content is ever shown."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SearchPage.tsx",
          "operation": "modify",
          "description": "Rewrite the photo search tab to use the Unsplash Source URL pattern (https://source.unsplash.com/400x300/?{encodeURIComponent(query)},{index}) for 12 images with Picsum (https://picsum.photos/seed/{query}-{index}/400/300) as automatic per-image fallback on load error. Rewrite the video search tab to call the Pexels Videos API free tier (https://api.pexels.com/videos/search) using a PEXELS_API_KEY placeholder constant, displaying up to 9 inline playable <video> elements with poster thumbnails; on API failure, fall back to a curated pool of at least 40 keyword-mapped direct MP4 URLs from Mixkit/Coverr/Pixabay covering diverse categories (nature, sports, travel, animals, food, technology, music, cities, space, etc.). Remove all random, hash-based, or hardcoded placeholder logic. Ensure all results remain private and are not saved to user profiles."
        }
      ]
    },
    {
      "id": "REQ-42",
      "summary": "Fix ImageGenerator to reliably produce and display real AI-generated images using Pollinations AI with automatic retry logic",
      "acceptanceCriteria": [
        "Submitting any text prompt triggers a visible loading spinner.",
        "A Pollinations AI image URL constructed from the prompt and a random seed is used as the <img> src.",
        "If the image fails to load, the component automatically retries up to 3 times with different seed values before showing an error message.",
        "The displayed image visually corresponds to the user's prompt.",
        "No keyword mapping, hash-based, or random-placeholder logic exists in the component.",
        "The Save to Profile and Download buttons remain functional using the resolved image URL."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ImageGenerator.tsx",
          "operation": "modify",
          "description": "Rewrite to use the Pollinations AI image generation API (https://image.pollinations.ai/prompt/{encodeURIComponent(prompt)}?seed={seed}&width=800&height=600&nologo=true) as the sole source. Generate a unique random seed on each generation attempt. Implement automatic retry logic: on image load error (broken src, network error, or HTTP failure), retry up to 3 times using different seed values (seed+1, seed+2, seed+3) before displaying a clear user-facing error message. Show a visible loading spinner while the image is being fetched. Remove all keyword mapping, hash-based selection, or random placeholder logic. Ensure Save to Profile and Download actions remain functional using the final resolved image URL."
        }
      ]
    },
    {
      "id": "REQ-43",
      "summary": "Fix VideoGenerator to reliably produce and display real AI-generated or API-matched videos using Pollinations AI with Pexels API fallback",
      "acceptanceCriteria": [
        "Submitting any text prompt triggers a visible loading spinner.",
        "The component first attempts the Pollinations AI video endpoint with the user's prompt.",
        "If Pollinations fails or times out, the component falls back to the Pexels Videos API using the prompt as the search query.",
        "The first valid video result is displayed as an inline playable <video> element with controls immediately after generation completes.",
        "No saving or downloading is required to watch the video inline.",
        "If both sources fail, a user-facing error message with a Retry button is shown.",
        "No local keyword-to-video mapping exists in the component.",
        "Save and Share buttons remain functional once a video is loaded."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/VideoGenerator.tsx",
          "operation": "modify",
          "description": "Rewrite to call the Pollinations AI video endpoint (https://video.pollinations.ai/prompt/{encodeURIComponent(prompt)}) as the primary source and display the result as an inline <video> element with controls and autoplay muted. If that endpoint returns an error or no playable content within 10 seconds, fall back to the Pexels Videos API free tier (https://api.pexels.com/videos/search?query={encodeURIComponent(prompt)}&per_page=5&orientation=landscape) using a PEXELS_API_KEY placeholder constant; display the first valid SD-quality direct MP4 URL as an inline <video> element. Show a loading spinner during all API calls. On failure of both sources, display a clear user-facing error message with a Retry button. Remove all local keyword-to-video mapping logic. Ensure Save and Share actions remain available after a video is loaded."
        }
      ]
    }
  ]
}