{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore original dark neon theme layout across all screens",
  "requirements": [
    {
      "id": "REQ-54",
      "summary": "Restore the original dark neon theme layout with deep near-black backgrounds, vibrant neon accent colors (electric violet, cyan, hot pink), glowing UI elements, animated text effects, gradient highlights, and sleek futuristic styling across all pages and components",
      "acceptanceCriteria": [
        "All pages render with deep near-black backgrounds (no light or white backgrounds visible).",
        "Neon accent colors (cyan, violet, hot pink) are consistently applied to buttons, borders, headings, and interactive elements across all screens.",
        "Glowing UI elements and gradient highlights are visible on cards, nav items, and action buttons.",
        "Navigation (desktop sidebar and mobile bottom nav) uses the dark neon theme with no light-mode styling.",
        "Login and Register pages display the neon dark theme with styled form fields and neon-colored call-to-action buttons.",
        "The Settings, Profile, Create, Search, Chat, Contacts, Home, CustomizeDesign, and PurchaseConfirmation pages all render consistently in the dark neon style.",
        "Animated text effects (shimmer, glow, or typewriter) are present where previously applied (e.g., AnimatedHeading component usage).",
        "No page or component defaults to a light or unstyled white background."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Ensure all CSS custom properties for the dark neon design system are properly defined with deep near-black backgrounds (--background, --card), vibrant neon accent colors (--cyan, --pink, --violet, --green, --yellow), and high-contrast text colors. Verify dark mode class applies these tokens consistently."
        },
        {
          "path": "frontend/index.css",
          "operation": "modify",
          "description": "Verify and strengthen the root-level dark theme tokens to ensure deep near-black backgrounds and neon accent colors are applied globally. Add any missing neon color variable definitions that should cascade to all components."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Ensure the Tailwind theme extension includes all neon color tokens (cyan, pink, violet, green, yellow) as custom colors accessible via utility classes. Verify dark mode configuration is active and that background/foreground colors reference the darkest values from the design system."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Apply deep near-black background to the main layout container and header. Ensure desktop sidebar and mobile bottom navigation use neon accent colors with glowing effects on active items. Add gradient highlights to navigation elements and apply neon borders where appropriate."
        },
        {
          "path": "frontend/src/pages/LoginPage.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to the login page with a deep near-black background, neon-styled form fields (cyan/violet borders with glow effects), and a vibrant call-to-action button using neon gradient or solid neon color. Ensure all text is high-contrast against the dark background."
        },
        {
          "path": "frontend/src/pages/RegisterPage.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to the registration page matching the LoginPage styling: deep near-black background, neon-styled input fields with glowing borders, and vibrant neon-colored submit button. Ensure form labels and validation messages use high-contrast neon accent colors."
        },
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to the home page with deep near-black background. Ensure the welcome banner, quick action buttons, and profile summary cards use neon accent colors with glowing borders and gradient highlights. Integrate AnimatedHeading component for page title with shimmer or glow effect. Reference generated assets at frontend/public/assets/generated/app-bg.dim_1920x1080.png for background if appropriate."
        },
        {
          "path": "frontend/src/pages/ChatPage.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to the chat page with deep near-black background. Style message bubbles with neon borders and subtle glow effects, differentiate sent/received messages using cyan and violet accents. Ensure the message input area has neon-styled borders and send button uses vibrant neon color."
        },
        {
          "path": "frontend/src/pages/ContactsPage.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to the contacts page with deep near-black background. Style contact cards with neon borders and glowing effects on hover. Apply neon accent colors to tab navigation and action buttons (add contact, accept/decline requests). Ensure user avatars have neon-colored borders or glow effects."
        },
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to the profile page with deep near-black background. Style the profile header with neon gradient highlights, glowing avatar border, and neon-colored edit button. Ensure photo/video gallery tabs use neon accent colors and gallery items have subtle neon borders with glow effects on hover."
        },
        {
          "path": "frontend/src/pages/CreatePage.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to the create page with deep near-black background. Style tab navigation with neon accent colors and glowing active state. Ensure generator components and upload areas have neon-styled borders with gradient highlights. Apply neon colors to action buttons (generate, upload, share)."
        },
        {
          "path": "frontend/src/pages/SearchPage.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to the search page with deep near-black background. Style the search input with neon border and glow effect on focus. Apply neon accent colors to tab navigation (Photos/Videos) and ensure result cards have neon borders with glowing hover effects."
        },
        {
          "path": "frontend/src/pages/SettingsPage.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to the settings page with deep near-black background. Style settings sections with neon borders and gradient highlights. Ensure toggle switches use neon accent colors (cyan/pink) for active state with glowing effects. Style section headings with neon colors or integrate AnimatedHeading component."
        },
        {
          "path": "frontend/src/pages/CustomizeDesignPage.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to the customize design page with deep near-black background. Style the design preview area with neon border and glow effect. Apply neon accent colors to option selectors (color palette chips, size/finish buttons) with glowing active states. Ensure the purchase button uses vibrant neon gradient or solid neon color."
        },
        {
          "path": "frontend/src/pages/PurchaseConfirmationPage.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to the purchase confirmation page with deep near-black background. Style the order summary card with neon borders and gradient highlights. Use neon accent colors for pricing details and apply vibrant neon styling to the final confirmation button with glow effect."
        },
        {
          "path": "frontend/src/components/AnimatedHeading.tsx",
          "operation": "modify",
          "description": "Verify AnimatedHeading component applies neon-themed animations (shimmer, glow, typewriter) using the neon color palette from the design system. Ensure animation variants use cyan, violet, hot pink, and gradient effects consistent with the dark neon theme."
        },
        {
          "path": "frontend/src/components/StoriesRow.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to the stories row with deep near-black background. Style story avatars with neon-colored borders (cyan/violet rings) and glowing effects. Ensure hover state intensifies the glow and uses gradient highlights."
        },
        {
          "path": "frontend/src/components/StoryViewerModal.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to the story viewer modal with deep near-black overlay. Style the story card with neon gradient background, glowing borders, and neon-colored progress bar. Ensure user info text uses high-contrast neon accent colors."
        },
        {
          "path": "frontend/src/components/SuggestedUsers.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to suggested users cards with deep near-black background. Style user cards with neon borders and glowing effects on hover. Apply neon accent colors to add contact buttons with gradient highlights."
        },
        {
          "path": "frontend/src/components/TrendingTopics.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to trending topics with deep near-black background. Style hashtag chips with neon borders (cyan/violet) and glowing effects. Ensure hover state uses neon gradient highlights and intensified glow."
        },
        {
          "path": "frontend/src/components/DailyChallengeWidget.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to the daily challenge widget with deep near-black background. Style the widget card with neon border and gradient highlights. Apply neon accent colors to the challenge button with glow effect and integrate AnimatedHeading for the widget title."
        },
        {
          "path": "frontend/src/components/VideoFactsCarousel.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to the video facts carousel with deep near-black background. Style fact cards with neon borders and gradient backgrounds. Apply neon colors to navigation arrows and dot indicators with glowing active states. Reference generated assets at frontend/public/assets/generated/video-facts-bg.dim_800x450.png for carousel background if appropriate."
        },
        {
          "path": "frontend/src/components/MessageInput.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to the message input component with deep near-black background. Style the text input with neon border and glow effect on focus. Apply neon accent colors to attachment buttons and send button with gradient highlights."
        },
        {
          "path": "frontend/src/components/MessageList.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to the message list with deep near-black background. Style message bubbles with neon borders and subtle glow effects, using cyan for sent messages and violet for received. Ensure timestamps and avatars use high-contrast neon accent colors."
        },
        {
          "path": "frontend/src/components/PhotoGallery.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to the photo gallery with deep near-black background. Style photo grid items with neon borders and glowing hover effects. Ensure the lightbox overlay uses deep near-black background with neon-styled close button."
        },
        {
          "path": "frontend/src/components/VideoGallery.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to the video gallery with deep near-black background. Style video grid items with neon borders and glowing hover effects. Ensure video controls use neon accent colors consistent with the design system."
        },
        {
          "path": "frontend/src/components/PhotoUploader.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to the photo uploader with deep near-black background. Style the file input area with neon border and glowing dashed outline. Apply neon accent colors to the upload button with gradient highlights and ensure progress indicators use neon colors."
        },
        {
          "path": "frontend/src/components/VideoUploader.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to the video uploader with deep near-black background. Style the file input area with neon border and glowing dashed outline. Apply neon accent colors to the upload button with gradient highlights and ensure progress indicators use neon colors."
        },
        {
          "path": "frontend/src/components/ImageGenerator.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to the image generator with deep near-black background. Style the prompt input with neon border and glow effect on focus. Apply neon accent colors to action buttons (generate, download, save) with gradient highlights and glowing effects."
        },
        {
          "path": "frontend/src/components/VideoGenerator.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to the video generator with deep near-black background. Style the prompt input with neon border and glow effect on focus. Apply neon accent colors to action buttons (generate, refresh, download, share) with gradient highlights and glowing effects."
        },
        {
          "path": "frontend/src/components/DesignCustomizer.tsx",
          "operation": "modify",
          "description": "Apply dark neon theme to the design customizer form with deep near-black background. Style option selectors (color palettes, sizes, finishes) with neon borders and glowing active states. Apply neon accent colors to the quantity slider and custom text input with glow effects. Ensure the submit button uses vibrant neon gradient."
        }
      ]
    }
  ]
}