{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix media display layout, replace YouTube with alternative video sources, and use multiple image platforms",
  "requirements": [
    {
      "id": "REQ-27",
      "summary": "Fix ImageGenerator component layout to always display visible generated images using multiple public image platforms with fallback behavior",
      "acceptanceCriteria": [
        "Generated images display visibly in the ImageGenerator component after prompt submission",
        "No broken image icons or question mark placeholders appear for generated images",
        "Image sources are drawn from at least two different public platforms (e.g., Unsplash and Picsum/Pexels)",
        "If one image source URL fails to load, the component falls back to an alternative platform URL"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ImageGenerator.tsx",
          "operation": "modify",
          "description": "Replace single Unsplash source URL construction with multi-platform fallback logic. Implement image source prioritization: attempt Unsplash URLs first, then fall back to Picsum Photos (https://picsum.photos/) or Pexels source URLs if the primary source fails to load. Add onError handlers to <img> elements that automatically switch to the next available platform URL. Ensure the layout always renders a visible image by testing each fallback source in sequence. Update state management to track current image source and fallback attempts. Preserve existing save-to-profile and download functionality."
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Fix VideoGenerator component layout to render visible playable videos using direct MP4 URLs from alternative platforms, replacing all YouTube sources",
      "acceptanceCriteria": [
        "Generated videos display as an inline playable <video> element in the VideoGenerator component after prompt submission",
        "No YouTube URLs are used anywhere in the VideoGenerator component",
        "Video sources come from at least two alternative platforms (e.g., Mixkit CDN and Pexels direct MP4 URLs)",
        "No broken video icons or question mark placeholders appear for generated videos",
        "Videos play without requiring authentication or special permissions"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/VideoGenerator.tsx",
          "operation": "modify",
          "description": "Remove all YouTube-based video source URLs. Replace keyword-to-video mapping with direct MP4 URLs from at least two alternative platforms: use Mixkit CDN (https://assets.mixkit.co/videos/) as primary source and Pexels Videos free-tier direct MP4 links (via Pexels API or known direct URLs) as fallback. Implement multi-platform fallback: add onError handlers to the <video> element that automatically switch to the next available platform URL if the primary source fails to load. Ensure the generated video always renders as a playable inline <video> element with controls. Update the keyword mapping to reference direct MP4 URLs only. Preserve existing save, download, and share functionality."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Fix PhotoGallery component layout to render all photos visibly using multi-platform fallback for failed image sources",
      "acceptanceCriteria": [
        "Photos in the PhotoGallery grid view render visibly without question mark placeholders",
        "Photos in the PhotoGallery lightbox view render visibly",
        "If the primary image source fails to load, a fallback image from a secondary platform is shown",
        "Photos shared in chat messages also render without broken icons"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PhotoGallery.tsx",
          "operation": "modify",
          "description": "Add multi-platform fallback logic to handle failed image loads. When rendering photos from ExternalBlob.getDirectURL(), add onError handlers to <img> elements that fall back to a secondary public image source (e.g., Picsum Photos placeholder: https://picsum.photos/800/600) if the primary stored source fails to load. Ensure both grid view and lightbox view implement this fallback behavior. Update error state handling to show fallback images instead of broken icons. Preserve existing layout, loading skeletons, and object URL cleanup logic."
        },
        {
          "path": "frontend/src/components/MessageList.tsx",
          "operation": "modify",
          "description": "Add image fallback handling for photo attachments displayed in chat messages. When rendering image URLs in message bubbles, add onError handlers that fall back to a secondary public image platform (e.g., Picsum Photos) if the primary source fails. Ensure fallback images render visibly without broken icons. Preserve existing message bubble styling, sent/received differentiation, and scroll behavior."
        }
      ]
    },
    {
      "id": "REQ-30",
      "summary": "Fix VideoGallery component layout to render all videos visibly as playable inline elements using direct MP4 URLs from alternative platforms, removing YouTube sources",
      "acceptanceCriteria": [
        "Videos in the VideoGallery grid view render as playable <video> elements without question mark placeholders",
        "Videos shared in chat messages render and play inline without broken icons",
        "No YouTube URLs are used in the VideoGallery component",
        "Video sources include at least two alternative CDN/platform options for fallback"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/VideoGallery.tsx",
          "operation": "modify",
          "description": "Remove any YouTube-based video source handling. Ensure all videos render as inline playable <video> elements. Add multi-platform fallback logic: when a video source from ExternalBlob fails to load, add onError handlers to <video> elements that fall back to alternative CDN sources (e.g., Mixkit, Pexels Videos, Coverr, or Pixabay direct MP4 URLs). Implement fallback video URL arrays and iterate through them on error. Ensure the layout always displays playable videos without broken icons. Preserve existing responsive grid layout, loading states, and error handling for non-video cases."
        },
        {
          "path": "frontend/src/components/MessageList.tsx",
          "operation": "modify",
          "description": "Add video fallback handling for video attachments displayed in chat messages. Ensure videos render as inline playable <video> elements (not iframes). Add onError handlers to <video> elements that fall back to alternative platform MP4 URLs if the primary source fails. Remove any YouTube embed or iframe logic if present. Preserve existing message bubble layout and playback controls."
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Fix SearchPage photo and video tabs to display visible search results using multiple image platforms and direct MP4 video sources, replacing YouTube",
      "acceptanceCriteria": [
        "Photo search results display as visible images in the grid — no broken icons or question marks",
        "Photo search uses at least two image source platforms with fallback behavior",
        "Video search results display as playable inline <video> elements — not YouTube iframes",
        "No YouTube URLs or embeds are used in the video search results",
        "Video search sources come from at least two alternative platforms (e.g., Pexels API and Mixkit)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SearchPage.tsx",
          "operation": "modify",
          "description": "For the photo search tab: replace single Unsplash source URL construction with multi-platform fallback. Attempt Unsplash URLs first, then fall back to Picsum Photos or Pexels source URLs if images fail to load. Add onError handlers to <img> elements in the photo grid that automatically switch to the next available platform. For the video search tab: remove all YouTube embed or iframe logic. Replace with direct MP4 sources from at least two alternative platforms (e.g., Pexels Videos API free tier and Mixkit). Render video search results as inline playable <video> elements with controls. Implement onError handlers on <video> elements to fall back to alternative CDN URLs if the primary source fails. Ensure both tabs display visible media without broken icons or question mark placeholders. Preserve existing lightbox functionality for photos and grid layout."
        }
      ]
    }
  ]
}